<!doctype html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible">
    <title>Git-it</title>
    <meta name="description" content="learn git and github">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" href="../assets/imgs/favicon.png" type="image/x-icon">
    <link rel="stylesheet" href="../assets/css/style.css">
  </head>
  <body>
    <header id="challenge-header" class="site-header">
  <div class="lang-select">
    <select id="lang-select" class="lang-select">
      <option value="">English</option>
      <option value="zhtw">正體中文</option>
      <option value="ja">日本語</option>
    </select>
  </div>
  <div class="pagination">
    <a href="pull_never_out_of_date.html"
      <span class="hand">☜</span>
    </a>
    <a href="merge_tada.html"
      <span class="hand">☞</span>
    </a>
  </div>
  <a class="filledblock" href="../index-ja.html">
    Git-it
  </a>
  <span class="challenge-title">requesting you pull please</span>
</header>

<script type="text/javascript">
  var selector = document.getElementById('lang-select')
  var currentLang = "-ja".replace(/-/, '')
  selector.value = currentLang
  selector.addEventListener('change', function () {
    var currentChallenge = document.querySelector('.challenge-item.current')
    var dir = 'challenges' + (selector.value ? '-' + selector.value : '') + '/'
    var url = currentChallenge.href.replace(/challenges(.+)?\//, dir)
    location.href = url
  })
</script>

    <div class="wrapper" id="challenge-body">
      <div id="challenge-sidebar" class="sidebar">
  <ul class="list-of-challenges">
      <li>
        <a id="get_git" data-id="0" href="get_git.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          get git
        </a>
      </li>
      <li>
        <a id="repository" data-id="1" href="repository.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          repository
        </a>
      </li>
      <li>
        <a id="commit_to_it" data-id="2" href="commit_to_it.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          commit to it
        </a>
      </li>
      <li>
        <a id="githubbin" data-id="3" href="githubbin.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          GitHubbin
        </a>
      </li>
      <li>
        <a id="remote_control" data-id="4" href="remote_control.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          remote control
        </a>
      </li>
      <li>
        <a id="forks_and_clones" data-id="5" href="forks_and_clones.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          forks and clones
        </a>
      </li>
      <li>
        <a id="branches_arent_just_for_birds" data-id="6" href="branches_arent_just_for_birds.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          branches aren&#x27;t just for birds
        </a>
      </li>
      <li>
        <a id="its_a_small_world" data-id="7" href="its_a_small_world.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          it&#x27;s a small world
        </a>
      </li>
      <li>
        <a id="pull_never_out_of_date" data-id="8" href="pull_never_out_of_date.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          pull never out of date
        </a>
      </li>
      <li>
        <a id="requesting_you_pull_please" data-id="9" href="requesting_you_pull_please.html" class="challenge-item current">
          <div class="current-arrow">▶️</div>
          requesting you pull please
        </a>
      </li>
      <li>
        <a id="merge_tada" data-id="10" href="merge_tada.html" class="challenge-item">
          <div class="current-arrow">▶️</div>
          merge tada
        </a>
      </li>
  </ul>

</div>
      <div class="content">
        <div id="challenge-desc" class="challenge">
  <h2>&#x4ECA;&#x56DE;&#x306E;&#x8AB2;&#x984C;:</h2>
  <p>&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;Patchwork&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x9001;&#x308B;&#x3002;</p>
</div>

<h2>&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;</h2>

<p>&#x5909;&#x66F4;&#x3084;&#x6539;&#x5584;&#x3092;&#x30D5;&#x30A9;&#x30FC;&#x30AF;&#x3057;&#x305F;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x884C;&#x3063;&#x305F;&#x969B;&#x306B;&#x3001;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x30E1;&#x30F3;&#x30C6;&#x30CA;&#x30FC;&#x306B;&#x3001;
  &#x305D;&#x306E;&#x5909;&#x66F4;&#x3092;&#x9001;&#x308A;&#x3001;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x3067;&#x305D;&#x306E;&#x5909;&#x66F4;&#x3092;<strong>&#x30D7;&#x30EB;</strong>&#x3057;&#x3066;&#x307B;&#x3057;&#x3044;&#x3068;<strong>&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;</strong>&#x3057;&#x305F;&#x3044;&#x3068;&#x601D;&#x3046;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x304B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;
  &#x305D;&#x3046;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x7686;&#x304C;&#x305D;&#x306E;&#x5229;&#x76CA;&#x3092;&#x4EAB;&#x53D7;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x304C;&#x3001;<strong>&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;</strong>&#x3067;&#x3059;&#x3002;</p>

<p>&#x3053;&#x306E;&#x30EF;&#x30FC;&#x30AF;&#x30B7;&#x30E7;&#x30C3;&#x30D7;&#x3092;&#x7D42;&#x3048;&#x305F;&#x4EBA;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306B;&#x3042;&#x306A;&#x305F;&#x3092;&#x8FFD;&#x52A0;&#x3057;&#x305F;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;
  &#x305D;&#x3053;&#x3067;&#x3001;<strong>&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;</strong>&#x3092;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;&#x9001;&#x3063;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;: <a href="https://github.com/jlord/patchwork" target="_blank">github.com/jlord/patchwork</a></p>

<img src="../assets/imgs/pullrequest.png" width="600">

<h2>&#x30B9;&#x30C6;&#x30C3;&#x30D7;: &#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306E;&#x4F5C;&#x6210;</h2>
<p>&#x3042;&#x306A;&#x305F;&#x304C;GitHub&#x4E0A;&#x3067;&#x30D5;&#x30A9;&#x30FC;&#x30AF;&#x3057;&#x305F;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x884C;&#x3063;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x4ECA;&#x56DE;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;
<a href="https://github.com/jlord/patchwork">http://github.com/jlord/patchwork</a>&#x3067;&#x3059;&#x3002;</p>

<p>GitHub&#x306F;&#x3042;&#x306A;&#x305F;&#x304C;&#x30D5;&#x30A9;&#x30FC;&#x30AF;&#x3057;&#x305F;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x3092;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x3057;&#x305F;&#x3053;&#x3068;&#x3092;&#x691C;&#x77E5;&#x3057;&#x3066;&#x3001;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30A6;&#x30A7;&#x30D6;&#x30B5;&#x30A4;&#x30C8;&#x306E;&#x4E0A;&#x90E8;&#x306B;&#x8868;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
  &#x3082;&#x3057;&#x3042;&#x306A;&#x305F;&#x306E;&apos;add-username&apos;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x3092;&#x78BA;&#x8A8D;s&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x305F;&#x306A;&#x3089;&#x3001;&#x305D;&#x3053;&#x304B;&#x3089;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x3082;&#x3057;&#x305D;&#x3046;&#x3067;&#x306A;&#x3044;&#x306A;&#x3089;&#x3070;:</p>

<ul>
  <li>&#x53F3;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&apos;Pull request&apos;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&apos;New pull request&apos;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</li>
  <li>&#x9001;&#x308A;&#x305F;&#x3044;&#x5909;&#x66F4;&#x304C;&#x3042;&#x308B;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x3092;&#x9078;&#x629E;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;<strong>&apos;add-yourusername&apos;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x306B;&#x306A;&#x308B;&#x304B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</strong></li>
</ul>

<p>&#x3042;&#x306A;&#x305F;&#x304C;&#x9001;&#x308D;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306E;&#x8A73;&#x7D30;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x304C;&#x898B;&#x3089;&#x308C;&#x305F;&#x304B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;
  &#x3053;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&apos;gh-pages&apos;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x3068;&#x6BD4;&#x8F03;&#x3057;&#x3066;&#x3001;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3068;&#x95A2;&#x4FC2;&#x306E;&#x3042;&#x308B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3068;&#x5909;&#x66F4;&#x304C;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>

<p>&#x3082;&#x3057;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x304C;<strong>&#x30B3;&#x30F3;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;</strong>&#x6301;&#x3063;&#x3066;&#x3044;&#x305F;&#x306A;&#x3089;&#x3001;GitHub&#x306F;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x3092;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;
  &#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x3001;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x30AA;&#x30FC;&#x30CA;&#x30FC;&#x304B;&#x3089;&#x306E;&#x3001;&#x305D;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x30B3;&#x30F3;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3059;&#x308B;&#x6700;&#x3082;&#x826F;&#x3044;&#x65B9;&#x6CD5;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x308B;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3067;&#x3059;&#x3002;</p>

<p>&#x3082;&#x3057;&#x5168;&#x3066;&#x304C;&#x3042;&#x306A;&#x305F;&#x306E;&#x8003;&#x3048;&#x305F;&#x901A;&#x308A;&#x306B;&#x3046;&#x307E;&#x304F;&#x3044;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x306A;&#x3089;&#x4EE5;&#x4E0B;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;:</p>

<ul>
  <li>&apos;Create pull request&apos;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;</li>
  <li>&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x4F5C;&#x8005;&#x306B;&#x30D7;&#x30EB;&#x3057;&#x3066;&#x6B32;&#x3057;&#x3044;&#x5909;&#x66F4;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3068;&#x8AAC;&#x660E;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</li>
  <li>&apos;Send pull request&apos;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#xFF01;</li>
</ul>

<p><strong>&#x7D20;&#x6674;&#x3089;&#x3057;&#x3044;&#xFF01;&#x3042;&#x306A;&#x305F;&#x306F;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x4F59;&#x97FB;&#x306B;&#x6D78;&#x3063;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</strong>

</p><p>&#x3082;&#x3057;&#x3042;&#x306A;&#x305F;&#x306E;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x304C;&#x7533;&#x3057;&#x5206;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001;&#x3059;&#x3050;&#x306B;&#x30DE;&#x30FC;&#x30B8;&#x3055;&#x308C;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x5C11;&#x3057;&#x5F85;&#x3063;&#x3066;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x30DE;&#x30FC;&#x30B8;&#x3055;&#x308C;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001;
  Reporobot&#x304B;&#x3089;&#x306A;&#x305C;&#x30DE;&#x30FC;&#x30B8;&#x3067;&#x304D;&#x306A;&#x304B;&#x3063;&#x305F;&#x304B;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x304C;&#x3082;&#x3089;&#x3048;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;
  &#x305D;&#x306E;&#x3088;&#x3046;&#x306A;&#x5834;&#x5408;&#x306F;&#x3001;GitHub&#x4E0A;&#x3067;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x30AF;&#x30ED;&#x30FC;&#x30BA;&#x3057;&#x3066;&#x3001;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x5909;&#x66F4;&#x3092;&#x52A0;&#x3048;&#x3001;&#x305D;&#x306E;&#x5909;&#x66F4;&#x3092;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x3057;&#x3066;&#x518D;&#x5EA6;&#x30D7;&#x30EB;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x9001;&#x3063;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>

<div class="verify">
  <button class="white" id="verify-challenge">VERIFY</button>
  <ul id="verify-list">
  </ul>
  <button class="white full-width" id="clear-completed-challenge">Clear completed status</button>
</div>

        <div class="prenext">
  <div class="u-floatLeft">
    <a href="pull_never_out_of_date.html" class="u-inline-block all-caps">pull never out of date
    <div class="arrow-left"></div>
    </a>
  </div>
  <div class="u-textRight u-floatRight">
    <a href="merge_tada.html" class="u-inlineBlock all-caps">merge tada
    <div class="arrow-right"></div>
    </a>
  </div>
</div>
<footer>
  <ul>
    <li class="all-caps"><a href="../index-ja.html"><strong>Git-it Challenges</strong></a></li>
    <li class="all-caps"><a href="../pages/about.html">About</a></li>
    <li class="all-caps"><a href="../pages/dictionary.html">Dictionary</a></li>
    <li class="all-caps"><a href="../pages/resources.html">Resources</a></li>
    <li class="all-caps">
      <a href="http://github.com/jlord/git-it/issues/new" target="_blank">Open an Issue</a>
    </li>
  </ul>
</footer>
      </div>
    </div>

    <script>
      var challengeStatus = require('../lib/challenge-completed.js')
      var currentChallenge = 'requesting_you_pull_please'
      challengeStatus.completed(currentChallenge)
    </script>

    <script>require('../lib/handle-external-links.js')</script>
    <script>require('../lib/languages.js')</script>
    <script>require('../lib/challenge.js')</script>
  </body>
</html>
